app/controllers/messages_controller.rb

  def index
    @messages = @user.messages.find(:all, :order=>'id desc')
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 6 AND (`messages`.user_id = 1))

  def show
    @message = @user.messages.find(params[:id])
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 1 AND (`messages`.user_id = 1))

  def edit
    @message = @user.messages.find(params[:id])
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 1 AND (`messages`.user_id = 1))

  def create
    @message = @user.messages.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`facebook_id`, `created_at`, `body`, `updated_at`, `timezone`, `delivered_at`, `user_id`, `scheduled_at`, `scheduled_at_utc`) VALUES(154018416318, '2010-01-30 01:25:23', 'sdfsdf', '2010-01-30 01:25:23', 'Pacific Time (US & Canada)', NULL, 1, '2010-01-30 04:28:00', '2010-01-30 12:28:00')

  def update
    @message = @user.messages.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 2 AND (`messages`.user_id = 1))
UPDATE `messages` SET `updated_at` = '2010-01-22 05:23:26', `body` = 'This is what my message will look like in the extended status message organizer. Please take a look and let me know how it works.' WHERE `id` = 2

  def destroy
    @message = @user.messages.find(params[:id])
    @message.destroy
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 4 AND (`messages`.user_id = 1))
DELETE FROM `messages` WHERE `id` = 4